use bytes;
#=====================================================================================
#                        SetVariablesForWSJ.perl
#                             by Shinsuke Mori
#                             Last change : 14 May 2008
#=====================================================================================

# µ¡  Ç½ : Wall Street Journal (Penn Treebank) ¥³¡¼¥Ñ¥¹¤Î¤¿¤á¤ÎÄê¿ô¤ÎÄêµÁ
#
# Ãí  °Õ : ¤Ê¤·


#-------------------------------------------------------------------------------------
#                        set variables
#-------------------------------------------------------------------------------------

$CTEMPL = "../../../corpus/WSJ%02d.morphs";          # ¥³¡¼¥Ñ¥¹¤Î¥Õ¥¡¥¤¥ëÌ¾¤ÎÀ¸À®¤Î¿÷·¿

@Part     = qw(£Ó£Ù£Í     £Î£Î£Ð£Ó   £Ã£Ã       £Ã£Ä       ¡Æ¡Æ       ¡Ç¡Ç
               £Í£Ä       £Ò£Â       £Ê£Ê       £É£Î       £×£Ð¡ð     £Ä£Ô
               £Ö£Â       £Î£Î       £Õ£È       £Æ£×       £Å£Ø       £Ì£Ó
               ¡Ý£Ì£Ò£Â¡Ý ¡¤         £Ö£Â£Ä     ¡¥         £Ò£Ð       £Ö£Â£Ç
               ¡§         £Ô£Ï       ¡Ý£Ò£Ò£Â¡Ý £Ð£Ò£Ð¡ð   £×£Ð       £Ò£Â£Ò
               £Ö£Â£Î     £Ê£Ê£Ò     £Ò£Â£Ó     £Ê£Ê£Ó     £Ð£Ä£Ô     £Ö£Â£Ð
               ¡ð         £×£Ò£Â     ¡ô         £Î£Î£Ð     £×£Ä£Ô     £Î£Î£Ó
               £Ö£Â£Ú     £Ð£Ò£Ð     £Ð£Ï£Ó);
@PartCode = qw(SYMx       NNPS       CCxx       CDxx       LODQ       RCDQ
               MDxx       RBxx       JJxx       INxx       WPpx       DTxx
               VBxx       NNxx       UHxx       FWxx       EXxx       LSxx
               LRB-       Comm       VBDx       Peri       RPxx       VBGx
               Colo       TOxx       RRB-       PRPp       WPxx       RBRx
               VBNx       JJRx       RBSx       JJSx       PDTx       VBPx
               Doll       WRBx       Poun       NNPx       WDTx       NNSx
               VBZx       PRPx       POSx);

%Part = map(($Part[$_] => $_), (0..$#Part));
%PartCode = map(($PartCode[$_] => $_), (0..$#PartCode));

@UTPart = map($UT . $_, @Part);
@Tokens = ($UT, $BT, @Part);

@MorpMarkovTest = ("£Ô£è£å/£Ä£Ô", "£î£å£÷/£Ê£Ê", "£Î£Î", "£Î£Î");
@CharMarkovTest = ($BT, "£Ú");


#=====================================================================================
#                        END
#=====================================================================================
