#!/usr/bin/env perl
use bytes;
#=====================================================================================
#                       CorpusStat.perl
#                             bShinsuke Mori
#                             Last change 16 September 2012
#=====================================================================================

# 機  能 : 単語(表記) 2-gram のコーパスに対する統計
#
# 使用法 : CorpusStat.perl (STEP) [FILENAME]
#
# 実  例 : CorpusStat.perl 4
#
# 注意点 : (filestem).morp は "表記/品詞 ..." となっていなければならない。
#          行数が 4**ARGV[0] で割り切れる文だけを用いて学習する。


#-------------------------------------------------------------------------------------
#                        require
#-------------------------------------------------------------------------------------

use Env;
use File::Basename;
unshift(@INC, dirname($0), "$TKD53HOME/SLM/lib/perl");

require "Help.pm";
require "FancyPrint.pm";
require "class/IntStr.pm";


#-------------------------------------------------------------------------------------
#                        check arguments
#-------------------------------------------------------------------------------------

(((@ARGV == 1) || (@ARGV == 2)) && ($ARGV[0] ne "-help")) || &Help($0);
print STDERR join(" ", basename($0), @ARGV), "\n";

$STEP = 4**shift;                                 # 学習コーパスの文のステップ
$TEST = (@ARGV) ? shift : undef;


#-------------------------------------------------------------------------------------
#                        共通の変数や関数の定義を読み込む
#-------------------------------------------------------------------------------------

do "dofile/CrossEntropyBy.perl";
do "dofile/CrossEntropyByWordKKCI.perl";


#-------------------------------------------------------------------------------------
#                        $WordIntStr の生成
#-------------------------------------------------------------------------------------

(-e ($FILE = "WordIntStr.text")) ||               # ファイルがあるか？なければ作る。
    &WordIntStr($FILE, map(sprintf($CTEMPL, $_), @Kcross));
$WordIntStr = new IntStr($FILE);


#-------------------------------------------------------------------------------------
#                        学習コーパスの統計
#-------------------------------------------------------------------------------------

$Lchar = $Lword = $Lsent = 0;                     # 文字数・組数・文数
$Lknown = 0;                                      # 既知形態素数

goto NoL1 if ($TEST);
foreach $CORPUS (map(sprintf($CTEMPL, $_), @Kcross)){
    open(CORPUS) || die "Can't open $CORPUS: $!\n";
    warn "Reading $CORPUS\n";
    while (<CORPUS>){                             # 文単位のループ
        ($.%$STEP == 0) || next;
        $Lsent++;
        $Lchar += scalar(&Line2Chars($_));        # 文末記号を含まない
        @word = &Line2Units($_);                  # 文末記号を含まない
        $Lword += @word;
        $Lknown += scalar(grep($WordIntStr->int($_), @word));
    }
    close(CORPUS);
}
NoL1:


#-------------------------------------------------------------------------------------
#                        テストコーパスの統計
#-------------------------------------------------------------------------------------

$Tchar = $Tword = $Tsent = 0;                     # 文字数・組数・文数
$Tknown = 0;                                      # 既知形態素数

$CORPUS = $TEST ? $TEST : sprintf($CTEMPL, 10);   # テストコーパス
open(CORPUS) || die "Can't open $CORPUS: $!\n";
warn "Reading $CORPUS\n";
while (<CORPUS>){                                 # 文単位のループ
    $Tsent++;
    $Tchar += scalar(&Line2Chars($_));            # 文末記号を含まない
    @word = &Line2Units($_);                      # 文末記号を含まない
    $Tword += @word;
    $Tknown += scalar(grep($WordIntStr->int($_), @word));
#    print join("\n", grep(! $WordIntStr->int($_), @word)), "\n";
}
close(CORPUS);
warn "\n";
#exit;

#-------------------------------------------------------------------------------------
#                        結果の出力
#-------------------------------------------------------------------------------------

printf("STEP%d\n", $ARGV[0]);
printf("-----------------------------------------------------------\n");
printf("        |  文    数  |  単 語 数  |  文 字 数  |  カバー率 \n");
printf("--------+------------+------------+------------+-----------\n");
goto NoL2 if ($TEST);
printf(" 学  習 | %10s | %10s | %10s | %7.2f %% \n",
       map(&InsertCommas($_), $Lsent, $Lword, $Lchar), 100*$Lknown/$Lword);
NoL2:
printf(" テスト | %10s | %10s | %10s | %7.2f %% \n",
       map(&InsertCommas($_), $Tsent, $Tword, $Tchar), 100*$Tknown/$Tword);
printf("-----------------------------------------------------------\n");


#-------------------------------------------------------------------------------------
#                        close
#-------------------------------------------------------------------------------------

exit(0);


#=====================================================================================
#                        END
#=====================================================================================
