#=====================================================================================
#                        SCFGHashDisk.pm
#                             by Shinsuke MORI
#                             Last change : 4 September 1997
#=====================================================================================

# 機  能 : SCFG をハッシュを用いて実装する。
#
# 注意点 : 状態列からハッシュキーへの関数は連接であり、これが単射となる必要がある。


#-------------------------------------------------------------------------------------
#                        declalations
#-------------------------------------------------------------------------------------

require "class/SCFGHash.pm";

package SCFGHashDisk;
@ISA = qw( SCFGHash );

use Carp;
use POSIX;


#-------------------------------------------------------------------------------------
#                        set variables
#-------------------------------------------------------------------------------------

$SUFFIX = ".db";                                # ファイル名の拡張子


#-------------------------------------------------------------------------------------
#                        new
#-------------------------------------------------------------------------------------

# new(IntStr, SIZE)
# new(IntStr, SIZE, FILE)
#
# 機  能 : SCFG のためのハッシュを生成する。

sub new{
#    printf(STDERR "SCFGHashDisk::new(%d, %s)\n", $size, $FILE);
    (@_ == 4) || (@_ == 5) || die;
    my($type) = shift;
    ($SCFG::NonT, $SCFG::Dmax, $SCFG::Vmax) = (shift, shift, shift);
    my($FILE) = @_;

#    printf(STDERR "%s::new(%d, %d, %d, %s)\n",
#           $type, $SCFG::NonT, $SCFG::Dmax, $SCFG::Vmax, $FILE);

    my(%hash);
    my($HASH) = $FILE . $SUFFIX;
    if (-e $HASH){
        tie(%hash, DB_File, $HASH, O_RDWR) || die "Can't open $HASH: $!\n";
    }else{
        tie(%hash, DB_File, $HASH, O_CREAT|O_RDWR) || die "Can't open $HASH: $!\n";
    }

    return(bless(\%hash));
}


#-------------------------------------------------------------------------------------
#                        return
#-------------------------------------------------------------------------------------

1;


#=====================================================================================
#                        END
#=====================================================================================
