#!/bin/csh -f
#=====================================================================================
#                       LambdaCorpus.csh
#                             bShinsuke Mori
#                             Last change 5 August 2009
#=====================================================================================

# 機  能 : 9-fold の削除補間のためのコーパス作成
#
# 使用法 : LambdaCorpus.csh (STEM)
#
# 実  例 : LambdaCorpus.csh ~/SLM/text/MMH/MMH-L ~/SLM/text/MaxEntBTProb/model/EHJ
#
# 注意点 : なし


#-------------------------------------------------------------------------------------
#                        check arguments
#-------------------------------------------------------------------------------------

if ($#argv != 1) then
    echo "Usage: $0 (STEM)"
    exit(1)
endif


#-------------------------------------------------------------------------------------
#                        setvariables
#-------------------------------------------------------------------------------------

set STEM = $argv[1]

set AMIS = $HOME/SLM/text/MaxEntBTProb/amis-4.0/src/amis
set ACCU = 67372/68039                            # WithEx


#-------------------------------------------------------------------------------------
#                        Dir の作成
#-------------------------------------------------------------------------------------

/bin/mkdir -p corpus
cd corpus


#-------------------------------------------------------------------------------------
#                        コーパスの作成
#-------------------------------------------------------------------------------------

#$HOME/usr/bin/split.perl %02d.text 9 ../$STEM.text
#$HOME/usr/bin/split.perl %02d.tagger 9 ../$STEM.tagger

foreach N ( `seq -f %02g 1 9` )
#foreach N ( `seq -f %02g 1 3` )
#foreach N ( `seq -f %02g 4 6` )
#foreach N ( `seq -f %02g 7 9` )
    echo $N
    $HOME/link/resource/tool/StochSegCorpus/src/main $N
    $HOME/SLM/text/bin/TaggerBTProb.perl $ACCU $N.tagger
    $HOME/link/resource/tool/StochSegCorpus/bin/MonteCarlo-SSC.perl $N > $N.word
end


#-------------------------------------------------------------------------------------
#                        close
#-------------------------------------------------------------------------------------

echo Done $0
exit


#=====================================================================================
#                        END
#=====================================================================================
